УТ_для_edt/src/DataProcessors/смартОжидаемыеПоступленияГарантийныхЗапчастей/смартОжидаемыеПоступленияГарантийныхЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартОжидаемыеПоступленияГарантийныхЗапчастей</name>
  <comment>//смарт:ММ #010 137</comment>
</mdclass:DataProcessor>

УТ_для_edt/src/Enums/смартСтатусыПоГарантииПолучение/смартСтатусыПоГарантииПолучение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыПоГарантииПолучение</name>
  <comment>//смарт:ММ #044 137 20.07.2020</comment>
  <enumValues>
    <name>Компенсация</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПоступление</name>
    <comment>//смарт:ММ #010 137</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоОтПоставщика</name>
    <comment>//смарт:ММ #010 137</comment>
  </enumValues>
  <enumValues>
    <name>ПеремещеноНаДругиеЦели</name>
    <comment>//смарт:ММ 702 14.11.2021</comment>
  </enumValues>
  <enumValues>
    <name>ВозвращеноПоНазначению</name>
    <comment>//смарт:ММ 702 14.11.2021</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СтатусыЗаказовПоставщикам/СтатусыЗаказовПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовПоставщикам</name>
  <enumValues>
    <name>НеСогласован</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Подтвержден</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18/118</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10/110</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20/120</comment>
  </enumValues>
  <enumValues>
    <name>НДС5</name>
    <comment>Ставка НДС 5%</comment>
  </enumValues>
  <enumValues>
    <name>НДС5_105</name>
    <comment>Расчетная ставка НДС 5/105</comment>
  </enumValues>
  <enumValues>
    <name>НДС7</name>
    <comment>Ставка НДС 7%</comment>
  </enumValues>
  <enumValues>
    <name>НДС7_107</name>
    <comment>Расчетная ставка НДС 7/107</comment>
  </enumValues>
  <enumValues>
    <name>НДС22</name>
    <comment>Ставка НДС 22%</comment>
  </enumValues>
  <enumValues>
    <name>НДС22_122</name>
    <comment>Расчетная ставка НДС 22/122</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыОбеспечения</name>
  <enumValues>
    <name>ОтгрузитьОбособленно</name>
  </enumValues>
  <enumValues>
    <name>Отгрузить</name>
  </enumValues>
  <enumValues>
    <name>СоСклада</name>
  </enumValues>
  <enumValues>
    <name>ИзЗаказов</name>
  </enumValues>
  <enumValues>
    <name>Обособленно</name>
  </enumValues>
  <enumValues>
    <name>Требуется</name>
  </enumValues>
  <enumValues>
    <name>НеТребуется</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СтатусыВнутреннихЗаказов/СтатусыВнутреннихЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВнутреннихЗаказов</name>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/СпособыДоставки/СпособыДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыДоставки</name>
  <enumValues>
    <name>Самовывоз</name>
  </enumValues>
  <enumValues>
    <name>ДоКлиента</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчика</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаПоАдресу</name>
  </enumValues>
  <enumValues>
    <name>СиламиПоставщикаДоНашегоСклада</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоНашегоСклада</name>
  </enumValues>
  <enumValues>
    <name>СиламиПеревозчикаДоПунктаПередачи</name>
  </enumValues>
  <enumValues>
    <name>НашимиСиламиСАдресаОтправителя</name>
  </enumValues>
  <enumValues>
    <name>КПолучателюОпределяетСлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>ОтОтправителяОпределяетСлужбаДоставки</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуСоСклада</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуНаСклад</name>
  </enumValues>
  <enumValues>
    <name>ПоручениеЭкспедиторуВПункте</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяВРаспоряжении</name>
  </enumValues>
  <enumValues>
    <name>смартСамовывозСоСкладаАдмирал</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ВариантыПриемкиТоваров/ВариантыПриемкиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПриемкиТоваров</name>
  <enumValues>
    <name>РазделенаПоЗаказамИНакладным</name>
  </enumValues>
  <enumValues>
    <name>НеРазделенаПоЗаказамИНакладным</name>
  </enumValues>
  <enumValues>
    <name>МожетПроисходитьБезЗаказовИНакладных</name>
  </enumValues>
  <enumValues>
    <name>РазделенаТолькоПоНакладным</name>
  </enumValues>
  <enumValues>
    <name>НеРазделенаПоНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговорамБезЗаказовИНакладных</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговорамПослеЗаказовИлиНакладных</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговорамПослеНакладных</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленноеПодразделение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <comment>Реквизит введен для совместимости с Библиотекой типов и не выводится в пользовательский интерфейс. Заполняется автоматически по данным реквизита ЮрФизЛицо.</comment>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЮрФизЛицо</name>
    <type>
      <types>EnumRef.ЮрФизЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>НДСПоСтавкам4и2</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>РегистрационныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеМеждународное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНеПроверятьРиски</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтветсвтенныйЗаРиски</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>смартГенеральныйДиректор</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартБухгалтер</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтветственныйЗаЭДО</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>смартСтатусКонтактныхДанныхКонтрагента</name>
    <comment>// смарт:ММ #060 319 03.08.2020</comment>
    <type>
      <types>EnumRef.смартСтатусыКонтактныхДанныхКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>смартДатаОбновленияПоДаннымФНС</name>
    <comment>// смарт:ММ 08.10.2020 #076</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>смартНеОбновлятьКППВноситБухгалтерия</name>
    <comment>// смарт:ММ 03.11.2020 #076</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартЛизинговаяКомпания</name>
    <comment>//++ #1334 смарт: Фролов 17.04.2023 //Заявка на формирование и подписание договора из 1С </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтправлятьВсеДокументыЧерезЭДО</name>
    <comment>#1652 смарт: Ермаков 26,06,2024 / Доработка карточки Контрагента</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействуетС</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКПП</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияНаименований</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПолное</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/смартОжидаемыеПоступленияГарантийныхЗапчастей/Forms/Форма/Module.bsl
// ++ 04.11.2020
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ #Б4664 смарт: Шляпников 17.11.2025 / Маркировка радиоэлектронной продукции. Ожидаемые Поступления Гарантийных Запчастей.
	смартМаркировка.ДобавитьВТабличнуюЧастьКолонкиМаркировки(ЭтаФорма, "ГарантийныеЗапчасти", "ГарантийныеЗапчастиЗапчастьГарантийнаяОжидаемая", "ГарантийныеЗапчасти.ЗапчастьГарантийнаяОжидаемая");
	смартМаркировка.ДобавитьВТабличнуюЧастьКолонкиМаркировки(ЭтаФорма, "ГарантийныеЗапчасти", "ГарантийныеЗапчастиЗапчастьОтправленнаяПоставщиком", "ГарантийныеЗапчасти.ЗапчастьОтправленнаяПоставщиком", "смартЧестныйЗнакОМ1", "смартЧестныйЗнакЭР1");
	//-- #Б4664 смарт: Шляпников 17.11.2025
	
	НастроитьВидимостьДоступность();
	
КонецПроцедуры

// ++ 04.11.2020
&НаСервере
Процедура НастроитьВидимостьДоступность()
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		Элементы.ГарантийныеЗапчастиСклад.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЗаявкаНаГарантийныйРемонт.Ссылка КАК ЗаявкаНаГарантийныйРемонт,
	|	смартЗаявкаНаГарантийныйРемонт.Номер КАК НомерЗаявки,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура КАК ЗапчастьГарантийнаяОжидаемая,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура КАК ЗапчастьОтправленнаяПоставщиком,
	//++ смарт:ММ #044 224 08.08.2021 - Заявка на гарантийный ремонт 
	//|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерСтроки КАК НомерСтроки,
	//|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерПозиции КАК НомерПозиции,
	//-- смарт:ММ 08.08.2021
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Контрагент КАК Контрагент,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Количество КАК Количество,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Количество КАК КоличествоВЗаявке,
	// ++ 15.06.2020
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером.НоменклатураУстановленнаяКлиенту, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА &СкладПодЗаказ
	// ++ 25.10.2020
	|		КОГДА ЕСТЬNULL(смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером.НоменклатураУстановленнаяКлиенту, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			И ЕСТЬNULL(смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером.ДокументРазборки, ЗНАЧЕНИЕ(Документ.СборкаТоваров.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Документ.СборкаТоваров.ПустаяСсылка)
	|			ТОГДА &СкладПодЗаказ
	// --
	|		ИНАЧЕ &ОсновнойСклад
	|	КОНЕЦ КАК Склад
	// --
	|ИЗ
	|	Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяСпециалистомПоПретензиям КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	|		ПО смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка = смартЗаявкаНаГарантийныйРемонт.Ссылка
	// ++ 15.06.2020
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяИнженером КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером
	|		ПО смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка = смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером.Ссылка
	|			И смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.ИДСтрокиЗаполняетсяИнженером = смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером.ИДСтрокиЗаполняетсяИнженером
	// --
	|ГДЕ
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.СтатусПолучения НЕ В(&Статусы)
	|	И ВЫБОР
	|			КОГДА &ОтборПоНомерамЗаявок
	|				ТОГДА смартЗаявкаНаГарантийныйРемонт.Номер В (&НомераЗаявок)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоКонтрагентам
	|				ТОГДА смартЗаявкаНаГарантийныйРемонт.Поставщик В (&МассивПартнеров)
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И смартЗаявкаНаГарантийныйРемонт.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)";
	
	МассивСтатусов = Новый Массив;
	//24.08.2020 статус отправки заменен на статус получения, у логиста должно отображаться в обработке, если статус получения не заполнен
	//МассивСтатусов.Добавить(Перечисления.смартСтатусыПоГарантии.ОтгрузкаНеТребуется); // 27.02.2020 раскомментировано
	//МассивСтатусов.Добавить(Перечисления.смартСтатусыПоГарантии.ОтправленоПоставщику);
	//МассивСтатусов.Добавить(Перечисления.смартСтатусыПоГарантии.НечемЗаменить);
	//// 29.02.2020
	//МассивСтатусов.Добавить(Перечисления.смартСтатусыПоГарантии.ОжидаютсяДействия);
	//// 02.06.2020
	//МассивСтатусов.Добавить(Перечисления.смартСтатусыПоГарантии.ОжидаетсяОтправка);
	МассивСтатусов.Добавить(Перечисления.смартСтатусыПоГарантииПолучение.Компенсация);
	МассивСтатусов.Добавить(Перечисления.смартСтатусыПоГарантииПолучение.ОжидаетсяПоступление);
	МассивСтатусов.Добавить(Перечисления.смартСтатусыПоГарантииПолучение.ПолученоОтПоставщика);
	
	
	МассивПартнеров = Партнер.ВыгрузитьЗначения();
	МассивНомеровЗаявок = НомерЗаявки.ВыгрузитьЗначения();
	
	Запрос.УстановитьПараметр("Статусы", 				МассивСтатусов);
	Запрос.УстановитьПараметр("ОтборПоНомерамЗаявок", 	?(МассивНомеровЗаявок.Количество() = 0, Ложь, Истина));
	Запрос.УстановитьПараметр("НомераЗаявок", 			МассивНомеровЗаявок);
	Запрос.УстановитьПараметр("ОтборПоКонтрагентам", 	?(МассивПартнеров.Количество() = 0, Ложь, Истина));
	Запрос.УстановитьПараметр("МассивПартнеров", 		МассивПартнеров);
	
	// ++ 15.06.2020
	Запрос.УстановитьПараметр("СкладПодЗаказ", Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение);
	Запрос.УстановитьПараметр("ОсновнойСклад", Справочники.смартПредопределенныеЗначения.ОсновнойСклад.Значение);
	// --
	
	//++ смарт:ММ #044 224 08.08.2021 - Заявка на гарантийный ремонт 
	//ГарантийныеЗапчасти.Загрузить(Запрос.Выполнить().Выгрузить());
	ПромежуточнаяТЗ = Запрос.Выполнить().Выгрузить();
	ПромежуточнаяТЗ.Свернуть("ЗаявкаНаГарантийныйРемонт,НомерЗаявки,ЗапчастьГарантийнаяОжидаемая,ЗапчастьОтправленнаяПоставщиком,Контрагент,Склад", "Количество,КоличествоВЗаявке");
	ГарантийныеЗапчасти.Загрузить(ПромежуточнаяТЗ);
	//-- смарт:ММ 08.08.2021
	
	//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
	ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б6794 смарт: Шляпников 07.05.2026

КонецПроцедуры


&НаКлиенте
Процедура ПринятьКУчету(Команда)
	
	Отказ = Ложь;
	
	Отказ = ПроверитьЗаполненностьПолей();
	
	Если НЕ Отказ Тогда
		ПринятьКУчетуВариант2НаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьЗаполненностьПолей()
	
	Отказ = Ложь;
	
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("Отметка", Истина);
	СтруктураПоиска.Вставить("Контрагент", ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка"));
	// ++ 26.11.2020
	СтруктураПоиска.Вставить("ПрямаяПоставка", Ложь);
	// --
	
	НайденныеСтроки = ГарантийныеЗапчасти.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		Для Каждого ТекСтрока Из НайденныеСтроки Цикл
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В строке " + ТекСтрока.НомерСтроки + " не указан контрагент");
		КонецЦикла;
		Отказ = Истина;
		
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции

&НаСервере
Процедура ПринятьКУчетуВариант2НаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.Контрагент КАК Контрагент,
	|	ВТ.ДатаПоставки КАК ДатаПоставки,
	|	ВТ.НомерЗаявки КАК НомерЗаявки,
	|	ВТ.Количество КАК Количество,
	|	ВТ.КоличествоВЗаявке КАК КоличествоВЗаявке,
	|	ВЫРАЗИТЬ(ВТ.ЗаявкаНаГарантийныйРемонт КАК Документ.смартЗаявкаНаГарантийныйРемонт) КАК ЗаявкаНаГарантийныйРемонт,
	|	ВТ.ЗапчастьГарантийнаяОжидаемая КАК ЗапчастьГарантийнаяОжидаемая,
	|	ВТ.ЗапчастьОтправленнаяПоставщиком КАК ЗапчастьОтправленнаяПоставщиком,
	|	ВТ.Отметка КАК Отметка,	
	//++ смарт:ММ #044 224 08.08.2021 - Заявка на гарантийный ремонт
	//|	ВТ.НомерСтроки КАК НомерСтроки,
	//|	ВТ.НомерПозиции КАК НомерПозиции,
	//-- смарт:ММ 08.08.2021
	// ++ 26.11.2020
	|	ВТ.ПрямаяПоставка КАК ПрямаяПоставка,
	// ++ 22.03.2021
	|	ВТ.УстановкаНеТребуется КАК УстановкаНеТребуется,
	// --
	|	ВТ.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_ТЧ
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.ДатаПоставки КАК ДатаПоставки,
	|	ВТ_ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ВТ_ТЧ.Количество КАК Количество,
	|	ВТ_ТЧ.КоличествоВЗаявке КАК КоличествоВЗаявке,
	|	ВТ_ТЧ.ЗапчастьГарантийнаяОжидаемая КАК ЗапчастьГарантийнаяОжидаемая,
	|	ВТ_ТЧ.ЗапчастьОтправленнаяПоставщиком КАК Номенклатура,
	|	ВТ_ТЧ.Отметка КАК Отметка,
	|	ВТ_ТЧ.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	|	ВТ_ТЧ.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(смартЗаявкаНаГарантийныйРемонт.Организация, """") КАК Организация,	
	//++ смарт:ММ #044 224 08.08.2021 - Заявка на гарантийный ремонт 
	//|	ВТ_ТЧ.НомерСтроки КАК НомерСтроки,
	//|	ВТ_ТЧ.НомерПозиции КАК НомерПозиции,
	//-- смарт:ММ 08.08.2021
	|	смартЗаявкаНаГарантийныйРемонт.Поставщик КАК Партнер,
	// ++ 26.11.2020
	|	ВТ_ТЧ.ПрямаяПоставка КАК ПрямаяПоставка,
	// ++ 22.03.2021
	|	ВТ_ТЧ.УстановкаНеТребуется КАК УстановкаНеТребуется,
	// --
	|	ВТ_ТЧ.Склад КАК Склад
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	|		ПО ВТ_ТЧ.ЗаявкаНаГарантийныйРемонт = смартЗаявкаНаГарантийныйРемонт.Ссылка
	|ГДЕ
	|	ВТ_ТЧ.Отметка
	// ++ 26.11.2020
	|	И НЕ ВТ_ТЧ.ПрямаяПоставка
	// --
	|ИТОГИ
	|	МАКСИМУМ(Партнер)
	|ПО
	|	ДатаПоставки,
	|	Организация,
	|	Контрагент
	// ++ 26.11.2020
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ТЧ.ДатаПоставки КАК ДатаПоставки,
	|	ВТ_ТЧ.НомерЗаявки КАК НомерЗаявки,
	|	ВТ_ТЧ.Количество КАК Количество,
	|	ВТ_ТЧ.КоличествоВЗаявке КАК КоличествоВЗаявке,
	|	ВТ_ТЧ.ЗапчастьГарантийнаяОжидаемая КАК ЗапчастьГарантийнаяОжидаемая,
	|	ВТ_ТЧ.ЗапчастьОтправленнаяПоставщиком КАК Номенклатура,
	|	ВТ_ТЧ.Отметка КАК Отметка,
	|	ВТ_ТЧ.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	|	ВТ_ТЧ.Контрагент КАК Контрагент,
	|	ЕСТЬNULL(смартЗаявкаНаГарантийныйРемонт.Организация, """") КАК Организация,	
	//++ смарт:ММ #044 224 08.08.2021 - Заявка на гарантийный ремонт
	//|	ВТ_ТЧ.НомерСтроки КАК НомерСтроки,
	//|	ВТ_ТЧ.НомерПозиции КАК НомерПозиции,
	//-- смарт:ММ 08.08.2021
	|	смартЗаявкаНаГарантийныйРемонт.Поставщик КАК Партнер,
	|	ВТ_ТЧ.ПрямаяПоставка КАК ПрямаяПоставка,
	// ++ 22.03.2021
	|	ВТ_ТЧ.УстановкаНеТребуется КАК УстановкаНеТребуется,
	// --
	|	ВТ_ТЧ.Склад КАК Склад
	|ИЗ
	|	ВТ_ТЧ КАК ВТ_ТЧ
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт КАК смартЗаявкаНаГарантийныйРемонт
	|		ПО ВТ_ТЧ.ЗаявкаНаГарантийныйРемонт = смартЗаявкаНаГарантийныйРемонт.Ссылка
	|ГДЕ
	|	ВТ_ТЧ.Отметка
	|	И ВТ_ТЧ.ПрямаяПоставка";
	// --
	
	ОсновнойСклад = Справочники.смартПредопределенныеЗначения.ОсновнойСклад.Значение;
	
	Запрос.УстановитьПараметр("ВТ", ГарантийныеЗапчасти.Выгрузить());
	
	//++ смарт:ММ #044 224 20.07.2020
	//СтатусОжидаетсяПоступление = Перечисления.смартСтатусыПоГарантии.ОжидаетсяПоступление;
	СтатусОжидаетсяПоступление = Перечисления.смартСтатусыПоГарантииПолучение.ОжидаетсяПоступление;
	//-- смарт:ММ 20.07.2020

	// ++ 26.11.2020
	//РезультатЗапроса = Запрос.Выполнить();
	
	//ВыборкаДатаПоставки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаПрямаяПоставка = РезультатЗапроса[РезультатЗапроса.Количество() - 1].Выбрать();
	Пока ВыборкаПрямаяПоставка.Следующий() Цикл
		
		ИзменитьСтатусВЗаявкеНаГарантийныйРемонт(ВыборкаПрямаяПоставка, Неопределено, СтатусОжидаетсяПоступление, Неопределено, Истина);		
		
	КонецЦикла;
	
	ВыборкаДатаПоставки = РезультатЗапроса[РезультатЗапроса.Количество() - 2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// --
	
		
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Пока ВыборкаДатаПоставки.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(ВыборкаДатаПоставки.ДатаПоставки) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не во всех отмеченных строках указана дата поставки!");
			Продолжить;
		КонецЕсли;
				
		ВыборкаОрганизация = ВыборкаДатаПоставки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаОрганизация.Следующий() Цикл
			
			ВыборкаКонтрагент = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаКонтрагент.Следующий() Цикл
				
				ДокументЗаказПоставщику = СоздатьЗаказПоставщику(ВыборкаКонтрагент, ТекущийПользователь, ОсновнойСклад);			
							
				Если ЗначениеЗаполнено(ДокументЗаказПоставщику) И ДокументЗаказПоставщику.Проведен Тогда
					// ++ 13.06.2020
					// Приобретение товаров будут создавать вручную
					//	ДокументПриобретениеТоваров = СоздатьПриобретениеТоваров(ВыборкаКонтрагент, ДокументЗаказПоставщику);
					// --
					
					// ++ 15.06.2020
					//++ #Б-3170 смарт: Лопато 05.05.2025 //Заявка на гарантийный ремонт. Заказ на перемещение.  
					ДокументЗаказНаПеремещение = СоздатьЗаказНаПеремещение(ВыборкаКонтрагент, ТекущийПользователь, ОсновнойСклад, ДокументЗаказПоставщику);
					//-- #Б-3170 смарт: Лопато 05.05.2025
					// --
					
					Выборка = ВыборкаКонтрагент.Выбрать();
					
					Выборка.Сбросить();
					Пока Выборка.Следующий() Цикл						
						// ++ 01.11.2020
						//ИзменитьСтатусВЗаявкеНаГарантийныйРемонт(Выборка, ДокументЗаказПоставщику.Ссылка, СтатусОжидаетсяПоступление);
						ИзменитьСтатусВЗаявкеНаГарантийныйРемонт(Выборка, ДокументЗаказПоставщику.Ссылка, СтатусОжидаетсяПоступление, ДокументЗаказНаПеремещение);
						// --
					КонецЦикла;
					
					//++ #Б-3010 смарт: Фролов 30.04.2025 //Заявка на гарантийный ремонт. Заказ на перемещение (Основной - Склад ФСО).
					//++ #Б-3170 смарт: Лопато 05.05.2025 //Заявка на гарантийный ремонт. Заказ на перемещение.  
					ДокументЗаказНаПеремещение = СоздатьЗаказНаПеремещениеНеГарантийка(ВыборкаКонтрагент, ТекущийПользователь, ОсновнойСклад, ДокументЗаказПоставщику);
					//-- #Б-3170 смарт: Лопато 05.05.2025
					
					Выборка.Сбросить();
					Пока Выборка.Следующий() Цикл						

						ИзменитьСтатусВЗаявкеНаГарантийныйРемонт(Выборка, ДокументЗаказПоставщику.Ссылка, СтатусОжидаетсяПоступление, ДокументЗаказНаПеремещение);

					КонецЦикла;
					//-- #Б-3010 смарт: Фролов 30.04.2025

				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
		
КонецПроцедуры

&НаСервере
Функция СоздатьЗаказПоставщику(ВыборкаКонтрагент, ТекущийПользователь, ОсновнойСклад)
	
	ДокументЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();
	ДокументЗаказПоставщику.Дата 			= ВыборкаКонтрагент.ДатаПоставки;
	ДокументЗаказПоставщику.ДатаПоступления = ВыборкаКонтрагент.ДатаПоставки;
	ДокументЗаказПоставщику.Организация 	= ВыборкаКонтрагент.Организация;
	ДокументЗаказПоставщику.Склад 			= ОсновнойСклад;
	ДокументЗаказПоставщику.Контрагент 		= ВыборкаКонтрагент.Контрагент;
	ДокументЗаказПоставщику.Партнер 		= ВыборкаКонтрагент.Партнер;
	ДокументЗаказПоставщику.Менеджер 		= ТекущийПользователь;
	ДокументЗаказПоставщику.Приоритет 		= Справочники.Приоритеты.ПолучитьПриоритетПоУмолчанию(Неопределено);
	ДокументЗаказПоставщику.Статус 			= Перечисления.СтатусыЗаказовПоставщикам.Подтвержден; // если не подвержден, то не даст ввести документ на основани этого
	ДокументЗаказПоставщику.Валюта 			= Константы.ВалютаУправленческогоУчета.Получить();
	
	Если НЕ ЗначениеЗаполнено(ВыборкаКонтрагент.Контрагент.ИНН) Тогда
		ДокументЗаказПоставщику.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаПоИмпорту;
	Иначе
		ДокументЗаказПоставщику.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	КонецЕсли;
	
	//++ смарт:ММ 221 19.07.2021
	ДокументЗаказПоставщику.смартЗапчастиГарантийные = Истина;
	//-- смарт:ММ 19.07.2021
	
	Выборка = ВыборкаКонтрагент.Выбрать();
	
	НомераЗаявок = "";
	НомераЗаявокМассив = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		ТекНомерЗаявки = Выборка.НомерЗаявки;
		НоваяСтрока = ДокументЗаказПоставщику.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;
		
		// ++ 13.06.2020
		//НоваяСтрока.Количество 			= 1;
		//НоваяСтрока.КоличествоУпаковок 	= 1;		
		НоваяСтрока.Количество 			= Выборка.Количество;
		НоваяСтрока.КоличествоУпаковок 	= Выборка.Количество;

		НоваяСтрока.Склад 				= ОсновнойСклад;
		НоваяСтрока.ДатаПоступления 	= Выборка.ДатаПоставки;
		НоваяСтрока.СтавкаНДС 			= Перечисления.СтавкиНДС.БезНДС;
		
		//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонт = ТекНомерЗаявки;
		НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонтСсылка = Выборка.ЗаявкаНаГарантийныйРемонт;
		//-- #Б1132 смарт: Шляпников 14.10.2024

		
		Если НомераЗаявокМассив.Найти(ТекНомерЗаявки) = Неопределено Тогда
			НомераЗаявок = НомераЗаявок + ?(ЗначениеЗаполнено(НомераЗаявок), ", ", "") + ТекНомерЗаявки;
			НомераЗаявокМассив.Добавить(ТекНомерЗаявки);
		КонецЕсли;
	КонецЦикла;
	
	//ДокументЗаказПоставщику.Комментарий 	= "#Создан на основании Заявки на гарантийный ремонт №" + НомераЗаявок;
	ДокументЗаказПоставщику.Комментарий = Документы.смартЗаявкаНаГарантийныйРемонт.ПолучитьТекстКомментарияКДокументу(, НомераЗаявок);
	
	Попытка
		ДокументЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан и проведен документ " + ДокументЗаказПоставщику.Ссылка, ДокументЗаказПоставщику.Ссылка);
	Исключение
		ДокументЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
		СинонимДокумента = ДокументЗаказПоставщику.Метаданные().Синоним;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки() + "
		|Документ записан без проведения.");
	КонецПопытки;
	
	Возврат ДокументЗаказПоставщику.Ссылка;
	
КонецФункции

&НаСервере
Функция СоздатьПриобретениеТоваров(ВыборкаКонтрагент, ДокументЗаказПоставщику)
	
	ДокументПриобретениеТоваров = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
	
	ДокументПриобретениеТоваров.Заполнить(ДокументЗаказПоставщику);
	
	ДокументПриобретениеТоваров.Дата 			= ВыборкаКонтрагент.ДатаПоставки;
	
	ДокументПриобретениеТоваров.ЗаказПоставщику = ДокументЗаказПоставщику;
	ДокументПриобретениеТоваров.Комментарий = ДокументЗаказПоставщику.Комментарий;
	
	Для Каждого Строка Из ДокументПриобретениеТоваров.Товары Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", Строка.Номенклатура);
		ПараметрыОтбора.Вставить("Количество", Строка.Количество);
		
		НайденныеСтроки = ДокументЗаказПоставщику.Товары.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
			//Строка.смартНомерЗаявкиНаГарантийныйРемонт = НайденныеСтроки[0].смартНомерЗаявкиНаГарантийныйРемонт;
			Строка.смартНомерЗаявкиНаГарантийныйРемонтСсылка = НайденныеСтроки[0].смартНомерЗаявкиНаГарантийныйРемонтСсылка;
			//-- #Б1132 смарт: Шляпников 14.10.2024
		КонецЕсли;
	
	КонецЦикла;	
	
	Попытка
		// 14.04.2020
		//ДокументПриобретениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
		ДокументПриобретениеТоваров.Записать(РежимЗаписиДокумента.Запись);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + ДокументПриобретениеТоваров.Ссылка, ДокументПриобретениеТоваров.Ссылка);
	Исключение
		//ДокументПриобретениеТоваров.Записать(РежимЗаписиДокумента.Запись);
		//СинонимДокумента = ДокументПриобретениеТоваров.Метаданные().Синоним;
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		//|" + ОписаниеОшибки() + "
		//|Документ записан без проведения.");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат ДокументПриобретениеТоваров.Ссылка;
	
КонецФункции

// + 01.11.2020
//Процедура ИзменитьСтатусВЗаявкеНаГарантийныйРемонт(Выборка, ДокументДвижения, СтатусОжидаетсяПоступление)
//Процедура ИзменитьСтатусВЗаявкеНаГарантийныйРемонт(Выборка, ДокументДвижения, СтатусОжидаетсяПоступление, ДокументЗаказНаПеремещение)
Процедура ИзменитьСтатусВЗаявкеНаГарантийныйРемонт(Выборка, ДокументДвижения, СтатусОжидаетсяПоступление, ДокументЗаказНаПеремещение, ПрямаяПоставка = Ложь) // 26.11.2020
// --	
	
	// ++ 13.06.2020
	// Может быть ситуация, когда в табл.части специалиста указано одно количество, 
	// а ожидается поступление меньшего количества. В этом случае надо разделить строку в заявке на гар.ремонт 
	// с сохранением всех статусов, причем делить строку надо как в табл инженера, так и в табл специалиста.
	// В одной строке должен остаться статус тот, который текущий, а в другую строку должна скопироваться вся история статусов 
	// и измениться статус на «ожидается поступление»
		
	ИзменилосьКоличество = Ложь;
	Если Выборка.Количество <> Выборка.КоличествоВЗаявке Тогда
		ИзменилосьКоличество = Истина;
	КонецЕсли;
	// --
	
	ДокОбъект = Выборка.ЗаявкаНаГарантийныйРемонт.ПолучитьОбъект();
	
	// ++ 13.06.2020
	//ТекСтрока = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям[Выборка.НомерСтроки - 1];
	//++ смарт:ММ #044 224 08.08.2021 - Заявка на гарантийный ремонт 
	//Отбор = Новый Структура;
	//Отбор.Вставить("НомерПозиции", Выборка.НомерПозиции);
	//НайденныеСтроки = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
	//Если НайденныеСтроки.Количество() = 0 Тогда
	//	// Сюда не должно попасть!
	//	Возврат;
	//КонецЕсли;
	
	//ТекСтрока = НайденныеСтроки[0];
	
	Отбор = Новый Структура;
	 //++ смарт:Подкин #910 14.02.2022 11:40:59       
    Отбор.Вставить("Номенклатура", Выборка.ЗапчастьГарантийнаяОжидаемая);
    //	Отбор.Вставить("Номенклатура", Выборка.Номенклатура);
    //-- смарт:Подкин #910 14.02.2022 11:40:59

	НайденныеСтрокиСпециалист = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
	Если НайденныеСтрокиСпециалист.Количество() = 0 Тогда
		// Сюда не должно попасть!
		Возврат;
	КонецЕсли;

	КоличествоКЗаказуОстаток = Выборка.Количество;
	
	// Обходятся все строки заявки с указанной номенклатурой.
	// Если по сумме всех строк количество в заявке совпадает с количеством из обработки, то статус меняется у всех строк
	// Если заказано меньше, то строки обходятся по порядку, пока не будет поменян статус у нужного колиества. Возможно, какую-то строку придется разбить, т.к. количество в обработке может быть меньше, чем в заявке 
	
	// Отсортировать по возрастанию количества
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("НомерПозиции");
	Таблица.Колонки.Добавить("Количество");
	
	Для Каждого ТекСтрокаСпециалист Из НайденныеСтрокиСпециалист Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.НомерПозиции = ТекСтрокаСпециалист.НомерПозиции;
		НоваяСтрока.Количество = ТекСтрокаСпециалист.Количество;
	КонецЦикла;
	
	Таблица.Сортировать("Количество");
	
	Для Каждого СтрокаТаблица Из Таблица Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("НомерПозиции", СтрокаТаблица.НомерПозиции);
		НайденныеСтроки = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ТекСтрока = НайденныеСтроки[0];
		
		Если ИзменилосьКоличество Тогда
			
			Если КоличествоКЗаказуОстаток <= 0 Тогда
				Прервать;
			КонецЕсли;
			
			Если ТекСтрока.Количество <= КоличествоКЗаказуОстаток Тогда
				// У строки меняется статус, количества по строке хватило 
				
			Иначе
				
				// Необходимо разбить строку, т.к. в заявке количество больше, чем осталось оформить из заказанного
				
				// 1. Найти соответствующую строку инженера, изменить количество
				// 2. Добавить новую строку инженера - копию из п.1, откорректировать количество
				// 3. Добавить новую строку специалиста по претенциям, копию ТекСтрока
				// 4. Добавить новые строки истории статусов
				
				// 1. Найти соответствующую строку инженера, изменить количество 
				
				//ТекСтрока.Количество = Выборка.КоличествоВЗаявке - Выборка.Количество;
				
				ТекСтрока.Количество = ТекСтрока.Количество - КоличествоКЗаказуОстаток; // Количество по строке, у которой не будет изменен статус (незаказанное количество)
				
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("ИДСтрокиЗаполняетсяИнженером", ТекСтрока.ИДСтрокиЗаполняетсяИнженером);
				НайденныеСтрокиИнженера = ДокОбъект.ЗаполняетсяИнженером.НайтиСтроки(СтруктураОтбора);
				
				Если НайденныеСтрокиИнженера.Количество() > 0 Тогда
					ИсходнаяСтрокаИнженера = НайденныеСтрокиИнженера[0];
					ИсходнаяСтрокаИнженера.Количество = ТекСтрока.Количество; // Исходное количество - Ожидаемое от поставщика фактическое количество
					
					// 2. Добавить новую строку инженера - копию из п.1, откорректировать количество
					
					НоваяСтрокаИнженера = ДокОбъект.ЗаполняетсяИнженером.Вставить(ИсходнаяСтрокаИнженера.НомерСтроки);
					ЗаполнитьЗначенияСвойств(НоваяСтрокаИнженера, ИсходнаяСтрокаИнженера);
					НоваяСтрокаИнженера.ИДСтрокиЗаполняетсяИнженером = ДокОбъект.ПолучитьСледующийИДСтроки();
					//++ смарт:ММ #044 224 08.08.2021 - Заявка на гарантийный ремонт 
					//НоваяСтрокаИнженера.Количество = Выборка.Количество; // Фактически ожидаемое количество
					НоваяСтрокаИнженера.Количество = КоличествоКЗаказуОстаток; // Фактически ожидаемое количество
					//-- смарт:ММ 08.08.2021
					
					// ++ 20.12.2020
					// Копирование зависимой таблицы
					Отбор = Новый Структура;
					Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ИсходнаяСтрокаИнженера.ИДСтрокиЗаполняетсяИнженером);
					
					СтрокиДопДействия = ДокОбъект.ДополнительныеДействияИнженер.НайтиСтроки(Отбор);
					Для Каждого СтрокаДД Из СтрокиДопДействия Цикл
						НоваяСтрокаДопДействия = ДокОбъект.ДополнительныеДействияИнженер.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДД);
						НоваяСтрокаДопДействия.ИДСтрокиЗаполняетсяИнженером = НоваяСтрокаИнженера.ИДСтрокиЗаполняетсяИнженером;	
					КонецЦикла;
					// --
					
					// 3. Добавить новую строку специалиста по претензиям, копию ТекСтрока (эта строка в дальшейшем получит статус "Ожидается поступление")
					
					НоваяСтрокаСпециалист = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.Вставить(ТекСтрока.НомерСтроки);
					ЗаполнитьЗначенияСвойств(НоваяСтрокаСпециалист, ТекСтрока);
					НоваяСтрокаСпециалист.ИДСтрокиЗаполняетсяИнженером = НоваяСтрокаИнженера.ИДСтрокиЗаполняетсяИнженером;
					НоваяСтрокаСпециалист.Количество = НоваяСтрокаИнженера.Количество;  // Фактически ожидаемое количество
					НоваяСтрокаСпециалист.НомерПозиции = ДокОбъект.ПолучитьСледующийНомерПозиции();
					НоваяСтрокаСпециалист.ДатаДобавления = ТекущаяДата();
					
					// 4. Добавить новые строки истории статусов
					
					ОтборСтрокСтатусы = Новый Структура;
					ОтборСтрокСтатусы.Вставить("НомерПозиции", ТекСтрока.НомерПозиции);
					СтрокиСтатусов = ДокОбъект.Статусы.НайтиСтроки(ОтборСтрокСтатусы);
					
					Для Каждого СтрокаСтатус Из СтрокиСтатусов Цикл
						НоваяСтрокаСтатус = ДокОбъект.Статусы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаСтатус, СтрокаСтатус);
						НоваяСтрокаСтатус.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
					КонецЦикла;			
					
					// ++ 20.12.2020
					// Копирование зависимых таблиц
					НайденныеСтрокиИсторияРешений = ДокОбъект.ИсторияРешенийПоставщика.НайтиСтроки(ОтборСтрокСтатусы);
					Для Каждого СтрокаИстория Из НайденныеСтрокиИсторияРешений Цикл
						НоваяСтрокаИстория = ДокОбъект.ИсторияРешенийПоставщика.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаИстория, СтрокаИстория);
						НоваяСтрокаИстория.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
					КонецЦикла;
					
					НайденныеСтрокиДопДействия = ДокОбъект.ДополнительныеДействия.НайтиСтроки(ОтборСтрокСтатусы);
					Для Каждого СтрокаДопДействия Из НайденныеСтрокиДопДействия Цикл
						НоваяСтрокаДопДействия = ДокОбъект.ДополнительныеДействия.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДопДействия);
						НоваяСтрокаДопДействия.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
					КонецЦикла;
					// --
				КонецЕсли;	
				
				ТекСтрока = НоваяСтрокаСпециалист;
				
				
			КонецЕсли;
			
			
		КонецЕсли;
		
		//++ смарт:ММ #044 224 08.08.2021 - Заявка на гарантийный ремонт 
		КоличествоКЗаказуОстаток = КоличествоКЗаказуОстаток - ТекСтрока.Количество;
		//-- смарт:ММ 08.08.2021
		
		ТекСтрока.СтатусПолучения = СтатусОжидаетсяПоступление;
		
		Если Выборка.ЗапчастьГарантийнаяОжидаемая <> Выборка.Номенклатура Тогда
			ТекСтрока.АналогОтПоставщика = Выборка.Номенклатура;
		КонецЕсли;
		
		НоваяСтрокаСтатус = смартОбщегоНазначения.ПолучитьСтрокуСоСтатусом(ДокОбъект, ТекСтрока.НомерПозиции, СтатусОжидаетсяПоступление); 
		
		НоваяСтрокаСтатус.НомерПозиции 			= ТекСтрока.НомерПозиции;
		
		// ++ 26.11.2020
		Если ПрямаяПоставка Тогда
			НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= ТекущаяДата();
		Иначе
			// --
			НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= ДокументДвижения.Дата;
			
			// ++ 26.11.2020
		КонецЕсли;
		// --
		НоваяСтрокаСтатус.Статус 				= СтатусОжидаетсяПоступление;
		НоваяСтрокаСтатус.ДокументДвижения 		= ДокументДвижения;
		
		// ++ 01.11.2020
		// ++ 10.07.2021
		// В документе Заказ на перемещение может не быть текущей номенаклатуры (т.к. в него попадает не вся номенклатура из заказа поставщику),
		// поэтом реквизит заполнять надо не во всех случаях, а только если текущая номенклатура есть в нем
		Отбор = Новый Структура;
		Отбор.Вставить("Номенклатура", Выборка.Номенклатура);
		//++ #Б1132 смарт: Шляпников 01.11.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//Отбор.Вставить("смартНомерЗаявкиНаГарантийныйРемонт", ДокОбъект.Номер);
		Отбор.Вставить("смартНомерЗаявкиНаГарантийныйРемонтСсылка", ДокОбъект.Ссылка);
		//-- #Б1132 смарт: Шляпников 01.11.2024
		НайденныеСтроки = ДокументЗаказНаПеремещение.Товары.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			// --
			НоваяСтрокаСтатус.ДокументДвиженияДоп 	= ДокументЗаказНаПеремещение;
			// ++ 10.07.2021
		КонецЕсли;
		//--
		// -- 
		
		// ++ 26.11.2020
		Если ПрямаяПоставка Тогда
			ТекСтрока.ПрямаяПоставка = Истина;
		КонецЕсли;
		// --
	КонецЦикла;
	//-- смарт:ММ 08.08.2021
	
	
	
	//++ смарт:ММ #044 224 08.08.2021 - Заявка на гарантийный ремонт 
	// Перенесено выше

	//Если ИзменилосьКоличество Тогда
	//	// 1. Найти соответствующую строку инженера, изменить количество
	//	// 2. Добавить новую строку инженера - копию из п.1, откорректировать количество
	//	// 3. Добавить новую строку специалиста по претенциям, копию ТекСтрока
	//	// 4. Добавить новые строки истории статусов
	//	
	//	// 1. Найти соответствующую строку инженера, изменить количество 
	//	
	//	ТекСтрока.Количество = Выборка.КоличествоВЗаявке - Выборка.Количество;
	//	
	//	СтруктураОтбора = Новый Структура;
	//	СтруктураОтбора.Вставить("ИДСтрокиЗаполняетсяИнженером", ТекСтрока.ИДСтрокиЗаполняетсяИнженером);
	//	НайденныеСтрокиИнженера = ДокОбъект.ЗаполняетсяИнженером.НайтиСтроки(СтруктураОтбора);
	//	
	//	Если НайденныеСтрокиИнженера.Количество() > 0 Тогда
	//		ИсходнаяСтрокаИнженера = НайденныеСтрокиИнженера[0];
	//		ИсходнаяСтрокаИнженера.Количество = ТекСтрока.Количество; // Исходное количество - Ожидаемое от поставщика фактическое количество
	//		
	//		// 2. Добавить новую строку инженера - копию из п.1, откорректировать количество
	//		
	//		НоваяСтрокаИнженера = ДокОбъект.ЗаполняетсяИнженером.Вставить(ИсходнаяСтрокаИнженера.НомерСтроки);
	//		ЗаполнитьЗначенияСвойств(НоваяСтрокаИнженера, ИсходнаяСтрокаИнженера);
	//		НоваяСтрокаИнженера.ИДСтрокиЗаполняетсяИнженером = ДокОбъект.ПолучитьСледующийИДСтроки();
	//		НоваяСтрокаИнженера.Количество = Выборка.Количество; // Фактически ожидаемое количество
	//		
	//		// ++ 20.12.2020
	//		// Копирование зависимой таблицы
	//		Отбор = Новый Структура;
	//		Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", ИсходнаяСтрокаИнженера.ИДСтрокиЗаполняетсяИнженером);
	//		
	//		СтрокиДопДействия = ДокОбъект.ДополнительныеДействияИнженер.НайтиСтроки(Отбор);
	//		Для Каждого СтрокаДД Из СтрокиДопДействия Цикл
	//			НоваяСтрокаДопДействия = ДокОбъект.ДополнительныеДействияИнженер.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДД);
	//			НоваяСтрокаДопДействия.ИДСтрокиЗаполняетсяИнженером = НоваяСтрокаИнженера.ИДСтрокиЗаполняетсяИнженером;	
	//		КонецЦикла;
	//		// --
	//		
	//		// 3. Добавить новую строку специалиста по претензиям, копию ТекСтрока (эта строка в дальшейшем получит статус "Ожидается поступление")
	//		
	//		НоваяСтрокаСпециалист = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.Вставить(ТекСтрока.НомерСтроки);
	//		ЗаполнитьЗначенияСвойств(НоваяСтрокаСпециалист, ТекСтрока);
	//		НоваяСтрокаСпециалист.ИДСтрокиЗаполняетсяИнженером = НоваяСтрокаИнженера.ИДСтрокиЗаполняетсяИнженером;
	//		НоваяСтрокаСпециалист.Количество = НоваяСтрокаИнженера.Количество;  // Фактически ожидаемое количество
	//		НоваяСтрокаСпециалист.НомерПозиции = ДокОбъект.ПолучитьСледующийНомерПозиции();
	//		НоваяСтрокаСпециалист.ДатаДобавления = ТекущаяДата();
	//					
	//		// 4. Добавить новые строки истории статусов
	//		
	//		ОтборСтрокСтатусы = Новый Структура;
	//		ОтборСтрокСтатусы.Вставить("НомерПозиции", ТекСтрока.НомерПозиции);
	//		СтрокиСтатусов = ДокОбъект.Статусы.НайтиСтроки(ОтборСтрокСтатусы);
	//		
	//		Для Каждого СтрокаСтатус Из СтрокиСтатусов Цикл
	//			НоваяСтрокаСтатус = ДокОбъект.Статусы.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрокаСтатус, СтрокаСтатус);
	//			НоваяСтрокаСтатус.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
	//		КонецЦикла;			
	//		
	//		// ++ 20.12.2020
	//		// Копирование зависимых таблиц
	//		НайденныеСтрокиИсторияРешений = ДокОбъект.ИсторияРешенийПоставщика.НайтиСтроки(ОтборСтрокСтатусы);
	//		Для Каждого СтрокаИстория Из НайденныеСтрокиИсторияРешений Цикл
	//			НоваяСтрокаИстория = ДокОбъект.ИсторияРешенийПоставщика.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрокаИстория, СтрокаИстория);
	//			НоваяСтрокаИстория.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
	//		КонецЦикла;
	//		
	//		НайденныеСтрокиДопДействия = ДокОбъект.ДополнительныеДействия.НайтиСтроки(ОтборСтрокСтатусы);
	//		Для Каждого СтрокаДопДействия Из НайденныеСтрокиДопДействия Цикл
	//			НоваяСтрокаДопДействия = ДокОбъект.ДополнительныеДействия.Добавить();
	//			ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДопДействия);
	//			НоваяСтрокаДопДействия.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
	//		КонецЦикла;
	//		// --
	//	КонецЕсли;	
	//	
	//	ТекСтрока = НоваяСтрокаСпециалист;
	//	
	//КонецЕсли;
	
	// --
		
	//ТекСтрока.СтатусПолучения = СтатусОжидаетсяПоступление;
	//
	//Если Выборка.ЗапчастьГарантийнаяОжидаемая <> Выборка.Номенклатура Тогда
	//	ТекСтрока.АналогОтПоставщика = Выборка.Номенклатура;
	//КонецЕсли;
	//
	//НоваяСтрокаСтатус = смартОбщегоНазначения.ПолучитьСтрокуСоСтатусом(ДокОбъект, ТекСтрока.НомерПозиции, СтатусОжидаетсяПоступление); 
	//
	//НоваяСтрокаСтатус.НомерПозиции 			= ТекСтрока.НомерПозиции;
	//
	//// ++ 26.11.2020
	//Если ПрямаяПоставка Тогда
	//	НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= ТекущаяДата();
	//Иначе
	//// --
	//НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= ДокументДвижения.Дата;
	//
	//// ++ 26.11.2020
	//КонецЕсли;
	//// --
	//НоваяСтрокаСтатус.Статус 				= СтатусОжидаетсяПоступление;
	//НоваяСтрокаСтатус.ДокументДвижения 		= ДокументДвижения;
	//
	//// ++ 01.11.2020
	//// ++ 10.07.2021
	//// В документе Заказ на перемещение может не быть текущей номенаклатуры (т.к. в него попадает не вся номенклатура из заказа поставщику),
	//// поэтом реквизит заполнять надо не во всех случаях, а только если текущая номенклатура есть в нем
	//Отбор = Новый Структура;
	//Отбор.Вставить("Номенклатура", Выборка.Номенклатура);
	//Отбор.Вставить("смартНомерЗаявкиНаГарантийныйРемонт", ДокОбъект.Номер);
	//НайденныеСтроки = ДокументЗаказНаПеремещение.Товары.НайтиСтроки(Отбор);
	//Если НайденныеСтроки.Количество() <> 0 Тогда
	//// --
	//НоваяСтрокаСтатус.ДокументДвиженияДоп 	= ДокументЗаказНаПеремещение;
	//// ++ 10.07.2021
	//КонецЕсли;
	////--
	//// -- 
	//
	//// ++ 26.11.2020
	//Если ПрямаяПоставка Тогда
	//	ТекСтрока.ПрямаяПоставка = Истина;
	//КонецЕсли;
	//// --
	//-- смарт:ММ 08.08.2021
	
	Попытка 
		ДокОбъект.Записать();
	Исключение
		ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
	    СинонимДокумента = ДокОбъект.Метаданные().Синоним;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки() + "
		|Документ записан без проведения.");
	КонецПопытки;
				
КонецПроцедуры

// ++ 15.06.2020
&НаСервере
//++ #Б-3170 смарт: Лопато 05.05.2025 //Заявка на гарантийный ремонт. Заказ на перемещение.  
Функция СоздатьЗаказНаПеремещение(ВыборкаКонтрагент, ТекущийПользователь, ОсновнойСклад, ДокументЗаказПоставщику)
//-- #Б-3170 смарт: Лопато 05.05.2025
	
	ЗначениеВозврат = Документы.ЗаказНаПеремещение.ПустаяСсылка();
	
	ЕстьСтрокиКПеремещению = Ложь;
		
	ОсновнойСкладДляЗапчастейПодЗаказ = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение;
	
	//++ #Б-3010 смарт: Фролов 30.04.2025 //Заявка на гарантийный ремонт. Заказ на перемещение (Основной - Склад ФСО).
	СкладДляПеремещенияПриобретенныхДеталейПоГарантииОтПоставщика = 
		Справочники.смартПредопределенныеЗначения.Настройки.СкладДляПеремещенияПриобретенныхДеталейПоГарантииОтПоставщика;
	//-- #Б-3010 смарт: Фролов 30.04.2025
	
	Если НЕ ЗначениеЗаполнено(ОсновнойСкладДляЗапчастейПодЗаказ) Тогда
		Возврат ЗначениеВозврат;
	КонецЕсли;
	
	Выборка = ВыборкаКонтрагент.Выбрать();
	
	НомераЗаявок = "";
	НомераЗаявокМассив = Новый Массив;

	ДокументЗаказНаПеремещение = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	ВариантОбеспеченияИзЗаказов = Перечисления.ВариантыОбеспечения.ИзЗаказов; // Резервировать к дате

	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Склад <> ОсновнойСкладДляЗапчастейПодЗаказ Тогда
			Продолжить;
		КонецЕсли;
		
		// ++ 22.03.2021
		Если Выборка.УстановкаНеТребуется Тогда
			Продолжить;
		КонецЕсли;
		// --
		
		ЕстьСтрокиКПеремещению = Истина;
		
		ТекНомерЗаявки = Выборка.НомерЗаявки;
		
		НоваяСтрока = ДокументЗаказНаПеремещение.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;		
		НоваяСтрока.Количество 			= Выборка.Количество;
		НоваяСтрока.КоличествоУпаковок 	= Выборка.Количество;
		НоваяСтрока.ВариантОбеспечения 	= ВариантОбеспеченияИзЗаказов; 
		НоваяСтрока.НачалоОтгрузки 		= Выборка.ДатаПоставки;
		НоваяСтрока.ОкончаниеПоступления = Выборка.ДатаПоставки;
		
		//++ #Б1132 смарт: Шляпников 14.10.2024 / Ссылки на документ Заявка на гарантийный ремонт
		//НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонт = ТекНомерЗаявки;
		НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонтСсылка = Выборка.ЗаявкаНаГарантийныйРемонт;
		//-- #Б1132 смарт: Шляпников 14.10.2024
		
		Если НомераЗаявокМассив.Найти(ТекНомерЗаявки) = Неопределено Тогда
			НомераЗаявок = НомераЗаявок + ?(ЗначениеЗаполнено(НомераЗаявок), ", ", "") + ТекНомерЗаявки;
			НомераЗаявокМассив.Добавить(ТекНомерЗаявки);
		КонецЕсли;

	КонецЦикла;
	
	Если НЕ ЕстьСтрокиКПеремещению Тогда
		ДокументЗаказНаПеремещение = Неопределено;
		Возврат ЗначениеВозврат;
	КонецЕсли;
		
	ДокументЗаказНаПеремещение.Дата 			= ВыборкаКонтрагент.ДатаПоставки;
	ДокументЗаказНаПеремещение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокументЗаказНаПеремещение.Организация 		= ВыборкаКонтрагент.Организация;
	//ДокументЗаказНаПеремещение.Ответственный 	= ТекущийПользователь; //закомментировано по просьбе Стрекалова 30.09.2020
	ДокументЗаказНаПеремещение.Комментарий 		= Документы.смартЗаявкаНаГарантийныйРемонт.ПолучитьТекстКомментарияКДокументу(, НомераЗаявок);
	ДокументЗаказНаПеремещение.СкладОтправитель = ОсновнойСклад;
	ДокументЗаказНаПеремещение.СкладПолучатель 	= ОсновнойСкладДляЗапчастейПодЗаказ;
	ДокументЗаказНаПеремещение.Статус 			= Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	ДокументЗаказНаПеремещение.СпособДоставки 	= Перечисления.СпособыДоставки.Самовывоз;
	ДокументЗаказНаПеремещение.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным; 
	
	//++ смарт:ММ #044 224 21.11.2020 - Заявка на гарантийный ремонт 
	ДокументЗаказНаПеремещение.смартКонечнаяДатаРезерва = ДобавитьМесяц(ДокументЗаказНаПеремещение.Дата, 1);
	//-- смарт:ММ 21.11.2020
	
	//++ #Б1598 смарт: Шляпников 09.12.2024 / Раздельный учет товаров. Гарантийные запчасти. Дополнение.
	ДокументЗаказНаПеремещение.смартЗапчастиГарантийные = Истина;
	//-- #Б1598 смарт: Шляпников 09.12.2024
	
	//++ #Б-3170 смарт: Лопато 05.05.2025 //Заявка на гарантийный ремонт. Заказ на перемещение.  
	ДокументЗаказНаПеремещение.ДокументОснование = ДокументЗаказПоставщику;
	//-- #Б-3170 смарт: Лопато 05.05.2025
	
	Попытка
		ДокументЗаказНаПеремещение.Записать(РежимЗаписиДокумента.Проведение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан и проведен документ " + ДокументЗаказНаПеремещение.Ссылка, ДокументЗаказНаПеремещение.Ссылка);
	Исключение
		ДокументЗаказНаПеремещение.Записать(РежимЗаписиДокумента.Запись);
		СинонимДокумента = ДокументЗаказНаПеремещение.Метаданные().Синоним;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки() + "
		|Документ записан без проведения.", ДокументЗаказНаПеремещение.Ссылка);
	КонецПопытки;
	
	ЗначениеВозврат = ДокументЗаказНаПеремещение.Ссылка;
	
	Возврат ЗначениеВозврат;
	
КонецФункции 

&НаСервере
//++ #Б-3010 смарт: Фролов 30.04.2025 //Заявка на гарантийный ремонт. Заказ на перемещение (Основной - Склад ФСО).
//++ #Б-3170 смарт: Лопато 05.05.2025 //Заявка на гарантийный ремонт. Заказ на перемещение.  
Функция СоздатьЗаказНаПеремещениеНеГарантийка(ВыборкаКонтрагент, ТекущийПользователь, ОсновнойСклад, ДокументЗаказПоставщику)
//-- #Б-3170 смарт: Лопато 05.05.2025
	
	ЗначениеВозврат = Документы.ЗаказНаПеремещение.ПустаяСсылка();
	
	ЕстьСтрокиКПеремещению = Ложь;
		
	ОсновнойСкладДляЗапчастейПодЗаказ = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение;
	
	СкладДляПеремещенияПриобретенныхДеталейПоГарантииОтПоставщика = 
		Справочники.смартПредопределенныеЗначения.Настройки.СкладДляПеремещенияПриобретенныхДеталейПоГарантииОтПоставщика;
	
	Если НЕ ЗначениеЗаполнено(ОсновнойСкладДляЗапчастейПодЗаказ) Тогда
		Возврат ЗначениеВозврат;
	КонецЕсли;
	
	Выборка = ВыборкаКонтрагент.Выбрать();
	
	НомераЗаявок = "";
	НомераЗаявокМассив = Новый Массив;

	ДокументЗаказНаПеремещение = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	ВариантОбеспеченияИзЗаказов = Перечисления.ВариантыОбеспечения.ИзЗаказов; // Резервировать к дате

	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Склад = ОсновнойСкладДляЗапчастейПодЗаказ Тогда
			Продолжить;
		КонецЕсли;
		
		Если Выборка.УстановкаНеТребуется Тогда
			Продолжить;
		КонецЕсли;
		
		ЕстьСтрокиКПеремещению = Истина;
		
		ТекНомерЗаявки = Выборка.НомерЗаявки;
		
		НоваяСтрока = ДокументЗаказНаПеремещение.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Номенклатура;		
		НоваяСтрока.Количество 			= Выборка.Количество;
		НоваяСтрока.КоличествоУпаковок 	= Выборка.Количество;
		НоваяСтрока.ВариантОбеспечения 	= ВариантОбеспеченияИзЗаказов; 
		НоваяСтрока.НачалоОтгрузки 		= Выборка.ДатаПоставки;
		НоваяСтрока.ОкончаниеПоступления = Выборка.ДатаПоставки;
		
		НоваяСтрока.смартНомерЗаявкиНаГарантийныйРемонтСсылка = Выборка.ЗаявкаНаГарантийныйРемонт;
		
		Если НомераЗаявокМассив.Найти(ТекНомерЗаявки) = Неопределено Тогда
			НомераЗаявок = НомераЗаявок + ?(ЗначениеЗаполнено(НомераЗаявок), ", ", "") + ТекНомерЗаявки;
			НомераЗаявокМассив.Добавить(ТекНомерЗаявки);
		КонецЕсли;

	КонецЦикла;
	
	Если НЕ ЕстьСтрокиКПеремещению Тогда
		ДокументЗаказНаПеремещение = Неопределено;
		Возврат ЗначениеВозврат;
	КонецЕсли;
		
	ДокументЗаказНаПеремещение.Дата 			= ВыборкаКонтрагент.ДатаПоставки;
	ДокументЗаказНаПеремещение.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПеремещениеТоваров;
	ДокументЗаказНаПеремещение.Организация 		= ВыборкаКонтрагент.Организация;
	ДокументЗаказНаПеремещение.Комментарий 		= Документы.смартЗаявкаНаГарантийныйРемонт.ПолучитьТекстКомментарияКДокументу(, НомераЗаявок);
	ДокументЗаказНаПеремещение.СкладОтправитель = ОсновнойСклад;
	
	ДокументЗаказНаПеремещение.СкладПолучатель 	= СкладДляПеремещенияПриобретенныхДеталейПоГарантииОтПоставщика;
	
	ДокументЗаказНаПеремещение.Статус 			= Перечисления.СтатусыВнутреннихЗаказов.КВыполнению;
	ДокументЗаказНаПеремещение.СпособДоставки 	= Перечисления.СпособыДоставки.Самовывоз;
	ДокументЗаказНаПеремещение.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаПоЗаказамИНакладным; 
	
	ДокументЗаказНаПеремещение.смартКонечнаяДатаРезерва = ДобавитьМесяц(ДокументЗаказНаПеремещение.Дата, 1);
	
	ДокументЗаказНаПеремещение.смартЗапчастиГарантийные = Истина;

	//++ #Б-3170 смарт: Лопато 05.05.2025 //Заявка на гарантийный ремонт. Заказ на перемещение.  
	ДокументЗаказНаПеремещение.ДокументОснование = ДокументЗаказПоставщику;
	//-- #Б-3170 смарт: Лопато 05.05.2025
	
	Попытка
		ДокументЗаказНаПеремещение.Записать(РежимЗаписиДокумента.Проведение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан и проведен документ " + ДокументЗаказНаПеремещение.Ссылка, ДокументЗаказНаПеремещение.Ссылка);
	Исключение
		ДокументЗаказНаПеремещение.Записать(РежимЗаписиДокумента.Запись);
		СинонимДокумента = ДокументЗаказНаПеремещение.Метаданные().Синоним;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки() + "
		|Документ записан без проведения.", ДокументЗаказНаПеремещение.Ссылка);
	КонецПопытки;
	
	ЗначениеВозврат = ДокументЗаказНаПеремещение.Ссылка;
	
	Возврат ЗначениеВозврат;
	
КонецФункции //-- #Б-3010 смарт: Фролов 30.04.2025

&НаКлиенте
Процедура ПоказатьКолонкуПрямаяПоставкаПриИзменении(Элемент)
	  Элементы.ГарантийныеЗапчастиПрямаяПоставка.Видимость = ПоказатьКолонкуПрямаяПоставка;
КонецПроцедуры

//++ #3898 смарт: Шляпников 04.08.2025 / Проваливаться в ГЗ из списка Ожидаемых поступлений гарантийных запчастей
&НаКлиенте
Процедура ГарантийныеЗапчастиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ГарантийныеЗапчастиНомерЗаявки" Тогда
		
		ТекущаяСтрока = ГарантийныеЗапчасти.НайтиПоИдентификатору(ВыбраннаяСтрока);
		Если НЕ ТекущаяСтрока = Неопределено Тогда
			ПоказатьЗначение(, ТекущаяСтрока.ЗаявкаНаГарантийныйРемонт);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаСервере
Процедура ЗаполнитьДанныеОМаркировкеНоменклатуры()
	
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(ГарантийныеЗапчасти, "ЗапчастьГарантийнаяОжидаемая");
	смартМаркировка.ЗаполнитьИнформациюОМаркировкеВТаблицуНоменклатуры(ГарантийныеЗапчасти, "ЗапчастьОтправленнаяПоставщиком", "смартЧестныйЗнакОМ1", "смартЧестныйЗнакЭР1");
	
КонецПроцедуры

//++ #Б6794 смарт: Шляпников 07.05.2026 / Маркировка. Корректировка алгоритма определения Обязательной маркировки в карточке Номенклатура.
&НаКлиенте
Процедура ГарантийныеЗапчастиПриИзменении(Элемент)
	
	//++ #Б-6964 смарт: Фролов 25.05.2026 //Проверить обработку "Ожидаемые поступления гарантийных запчастей
	//ЗаполнитьДанныеОМаркировкеНоменклатуры();
	//-- #Б-6964 смарт: Фролов 25.05.2026
	
КонецПроцедуры

&НаКлиенте
//++ #Б-6964 смарт: Фролов 25.05.2026 //Проверить обработку "Ожидаемые поступления гарантийных запчастей
Процедура ГарантийныеЗапчастиЗапчастьГарантийнаяОжидаемаяПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГарантийныеЗапчасти.ТекущиеДанные;
	
	ТекущиеДанные.смартЧестныйЗнакОМ = смартМаркировка.НоменклатураПодлежитОбязательнойМаркировке(ТекущиеДанные.ЗапчастьГарантийнаяОжидаемая);
	ТекущиеДанные.смартЧестныйЗнакЭР = смартМаркировка.НоменклатураПодлежитЭксперементальнойМаркировке(ТекущиеДанные.ЗапчастьГарантийнаяОжидаемая);
	
КонецПроцедуры //-- #Б-6964 смарт: Фролов 25.05.2026

&НаКлиенте
//++ #Б-6964 смарт: Фролов 25.05.2026 //Проверить обработку "Ожидаемые поступления гарантийных запчастей
Процедура ГарантийныеЗапчастиЗапчастьОтправленнаяПоставщикомПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ГарантийныеЗапчасти.ТекущиеДанные;
	
	ТекущиеДанные.смартЧестныйЗнакОМ1 = смартМаркировка.НоменклатураПодлежитОбязательнойМаркировке(ТекущиеДанные.ЗапчастьОтправленнаяПоставщиком);
	ТекущиеДанные.смартЧестныйЗнакЭР1 = смартМаркировка.НоменклатураПодлежитЭксперементальнойМаркировке(ТекущиеДанные.ЗапчастьОтправленнаяПоставщиком);
	
КонецПроцедуры //-- #Б-6964 смарт: Фролов 25.05.2026
